dataset_gen/NS_Gauss_openfoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (0 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (128 128 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type            cyclic;
        neighbourPatch  right;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type            cyclic;
        neighbourPatch  left;
        faces
        (
            (1 5 6 2)
        );
    }
    bottom
    {
        type            cyclic;
        neighbourPatch  top;
        faces
        (
            (0 1 5 4)
        );
    }
    top
    {
        type            cyclic;
        neighbourPatch  bottom;
        faces
        (
            (3 2 6 7)
        );
    }
    frontAndBack
    {
        type            empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
